#Control flow (კონტროლის ნაკადი) პროგრამირების ერთ-ერთი 
# მნიშვნელოვანი კონცეფტია, რომელიც განსაზღვრავს, როგორ მიმდინარეობს პროგრამის შესრულება
# და როგორ ხდება სხვადასხვა ოპერაციების შესრულება პროგრამის ფარგლებში. მარტივად რომ ვთქვათ, control
# flow არის ის გზა, რომლითაც პროგრამა გადის სხვადასხვა გამოთვლიდან, პირობიდან ან ციკლიდან.
# control flow შემადგენელი ტექნიკები: Sequencing ნიშნავს პროგრამის ოპერაციების თანმიმდევრობით შესრულებას,
# Selection არის გადაწყვეტილების მიღების პროცესი, როდესაც პროგრამა გადაწყვეტს, თუ რომელ ალტერნატივაში უნდა გადაეწყოს,
# Iteration (ციკლი) არის პროცესი, როდესაც გარკვეული კოდი ერთდროულად რამდენიმეჯერ მეორდება. უმეტესად გამოიყენება for ან while ციკლები,
# recursion არის ტექნიკა, როდესაც ფუნქცია თვითონვე იწვევს საკუთარ თავს.
# Branching არის იგივე რაც Selection, მაგრამ ხშირად გამოიყენება, როცა გვაქვს რამდენიმე ალტერნატივა.