# List (სიის ტიპი): Mutable (მოცემულობა): List-ის ელემენტების შეცვლა შეიძლება.
# Mixed Data Types: List-ის ელემენტებს შეუძლიათ სხვადასხვა ტიპის მონაცემები მოიცავდეს,
# მაგალითად, რიცხვები, სტრიქონები, სხვა სიები და ა.შ.მოთავსებული მონაცემები: List-ს 
# შეიძლება ჰქონდეს რამდენიმე მონაცემი.შეცვლა: List-ში ინდივიდუალური ელემენტები შეიძლება შეიცვალოს.
my_list = [1, 2, 3, "hello", [4, 5]]
my_list[0] = 10  
print(my_list)  


# String (სტრიქონი):Immutable (არასაკითხი): String-ის ელემენტები არ შეიძლება შეიცვალოს.
# ერთგული სერვისი.მხოლოდ ტექსტური მონაცემები: String მხოლოდ სიმბოლოების მიმდევრობაა,
# ანუ თითოეული ელემენტი არის ერთ-ერთი სიმბოლო.შეცვლა შეუძლებელია: String-ში
# ინდივიდუალური სიმბოლოების შეცვლა შეუძლებელია.
my_string = "hello"


